Fabrication straight exceeds the standard length. Use the Optimize Length command to adjust the length.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
 Syntax
  C#
public static FailureDefinitionId FabricationStraigtLengthOversized { get; }
  Visual Basic
Public Shared ReadOnly Property FabricationStraigtLengthOversized As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ FabricationStraigtLengthOversized {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures MEPFabricationFailures Class
  Autodesk.Revit.DB Namespace